modules/dashboard/views/beneficiary/view.php

                        [
                            'attribute' => 'created_by',
                            'value' => function ($model) {
                                return User::findOne($model->created_by)->username ?? '{not set}';
---
SELECT * FROM `user` WHERE `id`='d43a84447acfb6840047dfc81bf5296e9dfdb9c9c8c1d44a4b7f51a78371b5ed'

                        [
                            'attribute' => 'updated_by',
                            'value' => function ($model) {
                                return User::findOne($model->updated_by)->username ?? '{not set}';
---
SELECT * FROM `user` WHERE `id`='d43a84447acfb6840047dfc81bf5296e9dfdb9c9c8c1d44a4b7f51a78371b5ed'