modules/dashboard/views/ambassador/_form.php

SELECT * FROM `field_officer`
---

                    <div class="col-12 col-sm-6">
                        <div class="form-group local-forms">
                            <?= $form->field($model, 'field_officer_id')->widget(Select2::classname(), [
                                'data' => ArrayHelper::map(FieldOfficer::find()->all(), 'id', 'name'),
                                'language' => 'en',
                                'options' => ['placeholder' => 'Select Field Officer ...'],
                                'pluginOptions' => [
                                    'allowClear' => true
                                ],
                            ]); ?>