modules/dashboard/views/field-officer/_form.php

SELECT * FROM `coordinator`
---

                    <div class="col-12 col-sm-6">
                        <div class="form-group local-forms">
                            <?= $form->field($model, 'coordinator_id')->widget(Select2::classname(), [
                                'data' => ArrayHelper::map(Coordinator::find()->all(), 'id', 'name'),
                                'language' => 'en',
                                'options' => ['placeholder' => 'Select Coordinator ...'],
                                'pluginOptions' => [
                                    'allowClear' => true
                                ],
                            ]); ?>