modules/dashboard/views/field-officer/view.php

                        [
                            'attribute' => 'created_by',
                            'value' => function ($model) {
                                return User::findOne($model->created_by)->username ?? '{not set}';
---
SELECT * FROM `user` WHERE `id` IS NULL

                        [
                            'attribute' => 'updated_by',
                            'value' => function ($model) {
                                return User::findOne($model->updated_by)->username ?? '{not set}';
---
SELECT * FROM `user` WHERE `id` IS NULL