modules/dashboard/controllers/AmbassadorController.php

    public function actionDelete($id)
    {
        // $this->findModel($id)->delete();
        $model = Ambassador::findOne($id);
        User::findOne($model->user_id)->delete();
---
SELECT * FROM `ambassador` WHERE `id`='7efd6cf317638240100012c4385aedc5d60b5a6baf4c264f6ded5baf5e993bf2'
DELETE FROM `user` WHERE `id`='7efd6cf317638240100012c4385aedc5d60b5a6baf4c264f6ded5baf5e993bf2'
SELECT * FROM `user` WHERE `id`='7efd6cf317638240100012c4385aedc5d60b5a6baf4c264f6ded5baf5e993bf2'