modules/dashboard/controllers/BeneficiaryController.php

SELECT * FROM `beneficiary` WHERE `id`='0000278456f78b7210f548a45e900aa7671114cd370936eb12ab770351110a8d'
---
    protected function findModel($id)
    {
        if (($model = Beneficiary::findOne(['id' => $id])) !== null) {