modules/dashboard/controllers/CoordinatorController.php

    public function actionDelete($id)
    {
        // $this->findModel($id)->delete();

        $model = Coordinator::findOne($id);
        User::findOne($model->user_id)->delete();
---
SELECT * FROM `coordinator` WHERE `id`='ce7e4b555dc778645a062a394bbd2cf70e8e13ece80b2affec87bd34adedddc0'
DELETE FROM `user` WHERE `id`='ce7e4b555dc778645a062a394bbd2cf70e8e13ece80b2affec87bd34adedddc0'
SELECT * FROM `user` WHERE `id`='ce7e4b555dc778645a062a394bbd2cf70e8e13ece80b2affec87bd34adedddc0'

    protected function findModel($id)
    {
        if (($model = Coordinator::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `coordinator` WHERE `id`='ce7e4b555dc778645a062a394bbd2cf70e8e13ece80b2affec87bd34adedddc0'