modules/dashboard/controllers/FieldOfficerController.php

    public function actionDelete($id)
    {
        // $this->findModel($id)->delete();

        $model = FieldOfficer::findOne($id);
        User::findOne($model->user_id)->delete();
---
SELECT * FROM `field_officer` WHERE `id`='28d9b594760a14665bccb3576873bcab2994197a3a1b9d27cc6455584ddb8551'
DELETE FROM `user` WHERE `id`='28d9b594760a14665bccb3576873bcab2994197a3a1b9d27cc6455584ddb8551'
SELECT * FROM `user` WHERE `id`='28d9b594760a14665bccb3576873bcab2994197a3a1b9d27cc6455584ddb8551'